In [1]:
import pandas as pd
import numpy as np
import datetime as dt

In [3]:
section2 = pd.read_csv("../Shared/CustomerDemographic.csv",index_col=0)
section2.head()

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12 00:00:00,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16 00:00:00,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20 00:00:00,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03 00:00:00,NaN,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13 00:00:00,Senior Editor,NaN,Affluent Customer,N,Yes,8.0

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Laraine,Medendorp,Female,93,1953-10-12 00:00:00,Executive Secretary,Health,Mass Customer,N,Yes,11.0
1,2,Eli,Bockman,Male,81,1980-12-16 00:00:00,Administrative Officer,Financial Services,Mass Customer,N,Yes,16.0
2,3,Arlin,Dearle,Male,61,1954-01-20 00:00:00,Recruiting Manager,Property,Mass Customer,N,Yes,15.0
3,4,Talbot,NaN,Male,33,1961-10-03 00:00:00,NaN,IT,Mass Customer,N,No,7.0
4,5,Sheila-kathryn,Calton,Female,56,1977-05-13 00:00:00,Senior Editor,NaN,Affluent Customer,N,Yes,8.0

In [6]:
section2['gender'].replace('U', 'Unknown', inplace=True)
section2['deceased_indicator'].replace('N', 0, inplace=True)
section2['deceased_indicator'].replace('Y', 1, inplace=True)
section2.head()

,customer_id,gender,past_3_years_bike_related_purchases,DOB,job_industry_category,wealth_segment,deceased_indicator,owns_car,tenure
0,1,Female,93,1953-10-12 00:00:00,Health,Mass Customer,0,Yes,11.0
1,2,Male,81,1980-12-16 00:00:00,Financial Services,Mass Customer,0,Yes,16.0
2,3,Male,61,1954-01-20 00:00:00,Property,Mass Customer,0,Yes,15.0
3,4,Male,33,1961-10-03 00:00:00,IT,Mass Customer,0,No,7.0
4,5,Female,56,1977-05-13 00:00:00,NaN,Affluent Customer,0,Yes,8.0

In [7]:
section2 = section2[section2['deceased_indicator'] == 0]
section2 =section2.drop(['deceased_indicator'], axis=1)
section2_clean = section2.dropna()
section2_clean.head()

,customer_id,gender,past_3_years_bike_related_purchases,DOB,job_industry_category,wealth_segment,owns_car,tenure
0,1,Female,93,1953-10-12 00:00:00,Health,Mass Customer,Yes,11.0
1,2,Male,81,1980-12-16 00:00:00,Financial Services,Mass Customer,Yes,16.0
2,3,Male,61,1954-01-20 00:00:00,Property,Mass Customer,Yes,15.0
3,4,Male,33,1961-10-03 00:00:00,IT,Mass Customer,No,7.0
5,6,Male,35,1966-09-16 00:00:00,Retail,High Net Worth,Yes,13.0

In [8]:
section2_clean['owns_car'].replace('Yes', 1, inplace=True)
section2_clean['owns_car'].replace('No', 0, inplace=True)
section2_clean = section2_clean[section2_clean['DOB'] != section2_clean.DOB.min()]
section2_clean.head()

/var/folders/02/jwkk2z4x0wv1vqp9p47gjgdw0000gn/T/ipykernel_38768/1731912562.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  section2_clean['owns_car'].replace('Yes', 1, inplace=True)
/var/folders/02/jwkk2z4x0wv1vqp9p47gjgdw0000gn/T/ipykernel_38768/1731912562.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  section2_clean['owns_car'].replace('No', 0, inplace=True)

,customer_id,gender,past_3_years_bike_related_purchases,DOB,job_industry_category,wealth_segment,owns_car,tenure
0,1,Female,93,1953-10-12 00:00:00,Health,Mass Customer,1,11.0
1,2,Male,81,1980-12-16 00:00:00,Financial Services,Mass Customer,1,16.0
2,3,Male,61,1954-01-20 00:00:00,Property,Mass Customer,1,15.0
3,4,Male,33,1961-10-03 00:00:00,IT,Mass Customer,0,7.0
5,6,Male,35,1966-09-16 00:00:00,Retail,High Net Worth,1,13.0

In [9]:
section2_clean['DOB'] = pd.to_datetime(section2_clean['DOB'])
section2_clean['age'] = (dt.datetime.now()-section2_clean['DOB'])/np.timedelta64(1, 'Y')
section2_clean['age_class'] = ((round(section2_clean['age'] / 10) *10)).astype(int)
section2_clean.head()

,customer_id,gender,past_3_years_bike_related_purchases,DOB,job_industry_category,wealth_segment,owns_car,tenure,age,age_class
0,1,Female,93,1953-10-12,Health,Mass Customer,1,11.0,69.585374,70
1,2,Male,81,1980-12-16,Financial Services,Mass Customer,1,16.0,42.388114,40
2,3,Male,61,1954-01-20,Property,Mass Customer,1,15.0,69.311401,70
3,4,Male,33,1961-10-03,IT,Mass Customer,0,7.0,61.604552,60
5,6,Male,35,1966-09-16,Retail,High Net Worth,1,13.0,56.648388,60

In [10]:
address = pd.read_csv("../Shared/CustomerAddress.csv", index_col=0)
address.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,NSW,Australia,10
1,2,6 Meadow Vale Court,2153,NSW,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,NSW,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [11]:
address_clean = address.dropna()
address.head()

,customer_id,address,postcode,state,country,property_valuation
0,1,060 Morning Avenue,2016,NSW,Australia,10
1,2,6 Meadow Vale Court,2153,NSW,Australia,10
2,4,0 Holy Cross Court,4211,QLD,Australia,9
3,5,17979 Del Mar Point,2448,NSW,Australia,4
4,6,9 Oakridge Court,3216,VIC,Australia,9

In [12]:
address.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 218.7+ KB

In [13]:
section3 = pd.merge(section2_clean, address_clean, left_index=True, right_index=True)
section3 = section3.dropna()
section3.head()

,customer_id_x,gender,past_3_years_bike_related_purchases,DOB,job_industry_category,wealth_segment,owns_car,tenure,age,age_class,customer_id_y,address,postcode,state,country,property_valuation
0,1,Female,93,1953-10-12,Health,Mass Customer,1,11.0,69.585374,70,1,060 Morning Avenue,2016,NSW,Australia,10
1,2,Male,81,1980-12-16,Financial Services,Mass Customer,1,16.0,42.388114,40,2,6 Meadow Vale Court,2153,NSW,Australia,10
2,3,Male,61,1954-01-20,Property,Mass Customer,1,15.0,69.311401,70,4,0 Holy Cross Court,4211,QLD,Australia,9
3,4,Male,33,1961-10-03,IT,Mass Customer,0,7.0,61.604552,60,5,17979 Del Mar Point,2448,NSW,Australia,4
5,6,Male,35,1966-09-16,Retail,High Net Worth,1,13.0,56.648388,60,7,4 Delaware Trail,2210,NSW,Australia,9

In [14]:
transactions = pd.read_excel("../Shared/KPMGfinal.xlsx", sheet_name='Transactions', index_col=0)
transactions = transactions.sort_values('customer_id')
transactions.head()

,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
transaction_id,,,,,,,,,,,,
14486,23,1,2017-03-27,0.0,Approved,Norco Bicycles,Mountain,low,small,688.63,612.88,33455.0
18970,11,1,2017-03-29,1.0,Approved,Giant Bicycles,Standard,high,medium,1274.93,764.96,35378.0
16423,9,1,2017-12-09,1.0,Approved,OHM Cycles,Road,medium,medium,742.54,667.40,37838.0
5157,47,1,2017-05-11,1.0,Approved,Trek Bicycles,Road,low,small,1720.70,1531.42,37823.0
13424,2,1,2017-02-21,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,38573.0

In [15]:
transactions.isna().sum()

product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [16]:
transactions.duplicated().sum()

0

In [17]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20000 entries, 14486 to 17469
Data columns (total 12 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   product_id               20000 non-null  int64
 1   customer_id              20000 non-null  int64
 2   transaction_date         20000 non-null  datetime64[ns]
 3   online_order             19640 non-null  float64
 4   order_status             20000 non-null  object
 5   brand                    19803 non-null  object
 6   product_line             19803 non-null  object
 7   product_class            19803 non-null  object
 8   product_size             19803 non-null  object
 9   list_price               20000 non-null  float64
 10  standard_cost            19803 non-null  float64
 11  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(2), object(5)
memory usage: 2.0+ MB

In [18]:
transactions['product_first_sold_date'] = pd.TimedeltaIndex(transactions['product_first_sold_date'], unit='D') + dt.datetime(1900, 1, 1)
transactions.head()

,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
transaction_id,,,,,,,,,,,,
14486,23,1,2017-03-27,0.0,Approved,Norco Bicycles,Mountain,low,small,688.63,612.88,1991-08-07
18970,11,1,2017-03-29,1.0,Approved,Giant Bicycles,Standard,high,medium,1274.93,764.96,1996-11-11
16423,9,1,2017-12-09,1.0,Approved,OHM Cycles,Road,medium,medium,742.54,667.40,2003-08-07
5157,47,1,2017-05-11,1.0,Approved,Trek Bicycles,Road,low,small,1720.70,1531.42,2003-07-23
13424,2,1,2017-02-21,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,2005-08-11

In [19]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20000 entries, 14486 to 17469
Data columns (total 12 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   product_id               20000 non-null  int64
 1   customer_id              20000 non-null  int64
 2   transaction_date         20000 non-null  datetime64[ns]
 3   online_order             19640 non-null  float64
 4   order_status             20000 non-null  object
 5   brand                    19803 non-null  object
 6   product_line             19803 non-null  object
 7   product_class            19803 non-null  object
 8   product_size             19803 non-null  object
 9   list_price               20000 non-null  float64
 10  standard_cost            19803 non-null  float64
 11  product_first_sold_date  19803 non-null  datetime64[ns]
dtypes: datetime64[ns](2), float64(3), int64(2), object(5)
memory usage: 2.0+ MB

In [20]:
transactions.shape

(20000, 12)

In [21]:
transactions_clean = transactions.dropna()
transactions_clean.shape

(19445, 12)

In [23]:
from pandas.core.generic import NDFrame
transactions_clean['transaction_date'].describe(include=[np.datetime64])

count                            19445
mean     2017-07-01 16:21:18.189766144
min                2017-01-01 00:00:00
25%                2017-04-01 00:00:00
50%                2017-07-03 00:00:00
75%                2017-10-02 00:00:00
max                2017-12-30 00:00:00
Name: transaction_date, dtype: object

In [24]:
most_recent_purchase = transactions_clean['transaction_date'].max()
transactions_clean['last_purchase_days_ago'] = most_recent_purchase - transactions_clean['transaction_date']
transactions_clean['last_purchase_days_ago'] /= np.timedelta64(1, 'D')
transactions_clean['profit'] = transactions_clean['list_price'] - transactions_clean['standard_cost']
transactions_clean.head()

/var/folders/02/jwkk2z4x0wv1vqp9p47gjgdw0000gn/T/ipykernel_38768/3593025375.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  transactions_clean['last_purchase_days_ago'] = most_recent_purchase - transactions_clean['transaction_date']
/var/folders/02/jwkk2z4x0wv1vqp9p47gjgdw0000gn/T/ipykernel_38768/3593025375.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  transactions_clean['last_purchase_days_ago'] /= np.timedelta64(1, 'D')
/var/folders/02/jwkk2z4x0wv1vqp9p47gjgdw0000gn/T/ipykernel_38768/3593025375.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  transactions_clean['profit'] = transactions_clean['list_price'] - transactions_clean['standard_cost']

,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date,last_purchase_days_ago,profit
transaction_id,,,,,,,,,,,,,,
14486,23,1,2017-03-27,0.0,Approved,Norco Bicycles,Mountain,low,small,688.63,612.88,1991-08-07,278.0,75.75
18970,11,1,2017-03-29,1.0,Approved,Giant Bicycles,Standard,high,medium,1274.93,764.96,1996-11-11,276.0,509.97
16423,9,1,2017-12-09,1.0,Approved,OHM Cycles,Road,medium,medium,742.54,667.40,2003-08-07,21.0,75.14
5157,47,1,2017-05-11,1.0,Approved,Trek Bicycles,Road,low,small,1720.70,1531.42,2003-07-23,233.0,189.28
13424,2,1,2017-02-21,0.0,Approved,Solex,Standard,medium,medium,71.49,53.62,2005-08-11,312.0,17.87

In [25]:
rfmTable = transactions_clean.groupby('customer_id').agg({
    'last_purchase_days_ago': lambda x: x.min(),
    'customer_id': lambda x: len(x),
    'profit': lambda x: x.sum()
})

rfmTable.rename(columns={
    'last_purchase_days_ago': 'recency',
    'customer_id': 'frequency',
    'profit': 'monetary_value'
    }, inplace=True
)

In [26]:
rfmTable.head()

             recency  frequency  monetary_value
customer_id
1                7.0         11         3018.09
2              128.0          3         2226.26
3              102.0          7         3290.21
4              195.0          2          220.57
5               16.0          6         2394.94

In [27]:
rfmTable.shape

(3492, 3)

In [28]:
quartiles = rfmTable.quantile(q=[0.25,0.50,0.75])
quartiles

      recency  frequency  monetary_value
0.25     18.0        4.0         1797.43
0.50     45.0        5.0         2798.99
0.75     88.0        7.0         4122.44

In [29]:
def ROneHotEncoder(x, p, d):
    if x <= d[p][0.25]:
        return 1
    elif x <= d[p][0.5]:
        return 2
    elif x <= d[p][0.75]:
        return 3
    else:
        return 4

def FMOneHotEncoder(x, p, d):
    if x <= d[p][0.25]:
        return 4
    elif x <= d[p][0.5]:
        return 2
    elif x <= d[p][0.75]:
        return 3
    else:
        return 1

In [30]:
rfmSeg = rfmTable
rfmSeg['r_score'] = rfmSeg['recency'].apply(ROneHotEncoder, args=('recency', quartiles))
rfmSeg['f_score'] = rfmSeg['frequency'].apply(FMOneHotEncoder, args=('frequency', quartiles))
rfmSeg['m_score'] = rfmSeg['monetary_value'].apply(FMOneHotEncoder, args=('monetary_value', quartiles))
rfmSeg.head()

             recency  frequency  monetary_value  r_score  f_score  m_score
customer_id
1                7.0         11         3018.09        1        1        3
2              128.0          3         2226.26        4        4        2
3              102.0          7         3290.21        4        3        3
4              195.0          2          220.57        4        4        4
5               16.0          6         2394.94        1        3        2

In [31]:
rfmSeg['rfm_class'] = 100 * rfmSeg['r_score'] + 10 * rfmSeg['f_score'] + rfmSeg['m_score']
rfmSeg['total_score'] = rfmSeg['r_score'] + rfmSeg['f_score'] + rfmSeg['m_score']
rfmSeg.head()

,recency,frequency,monetary_value,r_score,f_score,m_score,rfm_class,total_score
customer_id,,,,,,,,
1,7.0,11,3018.09,1,1,3,113,5
2,128.0,3,2226.26,4,4,2,442,10
3,102.0,7,3290.21,4,3,3,433,10
4,195.0,2,220.57,4,4,4,444,12
5,16.0,6,2394.94,1,3,2,132,6

In [32]:
rfm_quartiles = (rfmSeg['rfm_class'].min(), rfmSeg['rfm_class'].quantile(q=0.25),
                 rfmSeg['rfm_class'].median(), rfmSeg['rfm_class'].quantile(q=0.75),
                 rfmSeg['rfm_class'].max())
rfm_quartiles

(111, 144.0, 244.0, 344.0, 444)

In [33]:
def RFMClassOneHotEncoder(x, p, d):
    if x <= d[0]:
        return 'gold'
    elif x <= d[1]:
        return 'silver'
    elif x <= d[2]:
        return 'bronze'
    else:
        return 'basic'

rfmSeg['customer_title'] = rfmSeg['rfm_class'].apply(RFMClassOneHotEncoder, args=('rfm_class', rfm_quartiles))
rfmSeg

,recency,frequency,monetary_value,r_score,f_score,m_score,rfm_class,total_score,customer_title
customer_id,,,,,,,,,
1,7.0,11,3018.090000,1,1,3,113,5,silver
2,128.0,3,2226.260000,4,4,2,442,10,basic
3,102.0,7,3290.210000,4,3,3,433,10,basic
4,195.0,2,220.570000,4,4,4,444,12,basic
5,16.0,6,2394.940000,1,3,2,132,6,silver
...,...,...,...,...,...,...,...,...,...
3497,52.0,3,1648.320000,3,4,4,344,11,basic
3498,127.0,6,3147.330000,4,3,3,433,10,basic
3499,51.0,7,4955.250000,3,3,1,331,7,basic
3500,144.0,6,1785.860000,4,3,4,434,11,basic
5034,84.0,3,269.484972,3,4,4,344,11,basic

In [34]:
rfmSeg.to_excel("rfmSeg.xlsx")
transactions_clean.to_excel("transactions_clean.xlsx")
section3.to_excel("section3.xlsx")